const obj = {
  about: {
    KR: '회사소개',
    MN: 'Бидний тухай'
  },
  career: {
    KR: '인력',
    MN: 'Хүний нөөц'
  },
  team: {
    KR: '팀',
    MN: 'Хамт олон'
  },
  teamName: {
    KR: '팀',
    MN: 'Баг'
  },
  blog: {
    KR: '블로그',
    MN: 'Блог'
  },
  product: {
    KR: '포트폴리오',
    MN: 'Бүтээл'
  },
  address: {
    KR: '서울 금천구 가산디지털1로 5대륭테크노타운20차 402호',
    MN: 'Монгол улс, Улаанбаатар хот, Баянгол дүүрэг, 2-р хороо, 2-р хороолол, <br class="pcBreak">Сөүлийн гудамж, 47/1 байр'
  },
  phone: {
    KR: '+82 1644-5805',
    MN: '+976 7511-0023'
  },
  email: {
    KR: 'admin@tagoplus.co.kr',
    MN: 'admin@itwizard.mn'
  },
  history2018: {
    KR: 'OK토마토, 모렌소프트, 아이플랜비즈 등 다수업체 IT 아웃소싱 개발 용역 계약 체결',
    MN: 'OKtomato, morensoft, ilpanbiz etc... олон тооны компаниудтай хамтран IT outsourcing хийх гэрээ байгуулан амжилттай ажиллаж байна.'
  },
  history2019: {
    KR: 'IT 아웃소싱 분야 및 아웃소싱 SI',
    MN: 'IT outsourcing салбар болон outsourcing SI хөгжүүлэлт хийж хүрээгээ тэлсэн.'
  },
  history2020: {
    KR: '각종 솔루션 개발 및 유지보수 업무',
    MN: 'Төрөл бүрийн шийдэл боловсруулах, засвар үйлчилгээний ажиллууд хийгээд байна.'
  },
  history2021: {
    KR: '한국 IT Outsourcing 개발(60개 프로젝트) 수행',
    MN: 'Солонгос IT Outsourcing хөгжүүлэлт одоогоор (60 гаруй прожект дээр ажиллаад байна).'
  },
  ifYouWanna: {
    KR: '우리와 함께 <br>일하고 싶다면',
    MN: 'Хэрвээ бидэнтэй хамтарч<br>ажиллахыг хүсвэл.'
  },
  ifYouWannaQ: {
    KR: '개발자 여러분의 좋은 파트너이자<br>서포터가 되겠습니다',
    MN: 'Бид хөгжүүлэгч таны сайн хамтрагч,<br>дэмжигч байх болно.'
  },
  ourHistory: {
    KR: '우리의 히스토리',
    MN: 'Our history'
  },
  ifYouWannaSendCareer: {
    KR: '<span>이력서</span> 보내기.<br><p style="opacity: 0;"></p>',
    MN: '<span>Хэрвээ анкет</span><br>илгээх бол.'
  },
  careerSteps: {
    KR: '선발 단계',
    MN: 'Сонгон шалгаруулах үе шат'
  },
  step1: {
    KR: '이력서 접수',
    MN: 'Анкет хүлээн<br>авах'
  },
  step2: {
    KR: '이력서 심사<br>및 선발',
    MN: 'Анкетын<br>шалгаруулалт'
  },
  step3: {
    KR: '면접',
    MN: 'Ярилцлага<br>уулзалт'
  },
  step4: {
    KR: '최종 합격 발표',
    MN: 'Ажилд авах<br>санал'
  },
  checkBeforeSendCareer: {
    KR: '이력서 작성 전에 확인하십시오',
    MN: 'Өргөдөл гаргахаасаа өмнө шалгах'
  },
  require1: {
    KR: '이력서 제출시 성명, 주소, 이메일, 근무 경력을 올비르게 작성하십시오',
    MN: 'Анкет илгээхдээ өөрийн нэр, холбоо барих хаяг, цахим шуудангийн хаяг, ажлын туршлагаа үнэн зөв бөглөнө үү.'
  },
  require2: {
    KR: '이력서에 작성한 정보, 근무 경력이 거짓인 경우 채용을 중단할 수 있다',
    MN: 'Анкет дээр бичсэн мэдээлэл, ажлын туршлага худал байвал элсэлтийг цуцалж болно.'
  },
  require3: {
    KR: '채용 과정에서 직위에 따라 <b>추가 면접</b>, <b>추가 서류</b>, <b>실력 시험</b> 등이 추가될 수 있다',
    MN: 'Ажилд авах процесс дээр тухайн албан тушаалаас хамааран <strong>нэмэлт ярилцлага</strong>, <strong>лавлагаа</strong>,<br><strong>шалгалт</strong> гэх мэт зүйлс нэмэгдэж болно.'
  },
  require4: {
    KR: '지원 관련 문의는 <strong>admin@itwizard.mn</strong> 이메일을 보내주십시오.',
    MN: 'Дэмжлэгтэй холбоотой лавлагаа авахыг хүсвэл <strong>admin@itwizard.mn</strong> хаягаар имэйл илгээнэ үү.'
  },
  workplace: {
    KR: '공개채용',
    MN: 'Нээлттэй ажлын байр'
  },
  recommendedYou: {
    KR: '당신을 초대합니다',
    MN: 'Бид танд санал болгож<br>байна.'
  },
  recomm1: {
    KR: '편안한 근무 시설',
    MN: 'Тав тухтай ажиллах орчин'
  },
  recomm2: {
    KR: '활기차고 친절하며 재능있는 젊은 인재들',
    MN: 'Эрч хүчтэй, найрсаг, чадварлаг залуу хамт олон'
  },
  recomm3: {
    KR: '경쟁력 있는 임금 체계',
    MN: 'Хөдөлмөрийн зах зээлд өрсөлдөхүйц цалин'
  },
  recomm4: {
    KR: '분기별 상여금 지급',
    MN: 'Улирал бүр бонус цалин'
  },
  recomm5: {
    KR: '교통비 지급',
    MN: 'Унааны мөнгө'
  },
  recomm6: {
    KR: '지속적인 자기 개발 및 학습 기회 제공',
    MN: 'Тасралтгүй хөгжих, суралцах боломжийг олгоно'
  },
  aboutTitle: {
    KR: '정보기술 분야 선도',
    MN: 'Мэдээлэл технологийн салбарыг тэргүүлнэ'
  },
  aboutText: {
    KR: '"저희 회사는 2016년에 설립되어 대한민국 시장에서 IT 프로젝트를 아웃소싱하고 있으며 국내 시장과 무관하게 독립적으로 운영되고 있습니다. 전문 분야에서 경험이 풍부한 팀원을 구성하여 기술 산업에 첫 걸음을 내딛는 젊은 세대를 지원하게 되어 기쁩니다. 디지털 혁신 및 급속도로 변화하는 이 시대에 기술 기반 성공의 핵심 파트너가 되는 책임 있는 일에 젊은 세대를 지원하고 성장시키는 데 최선을 다하는 것이 저희의 비전입니다.',
    MN: 'Манай хамт олон нь 2016 оноос хойш үйл ажиллагаагаа явуулж байгаа бөгөөд бид Солонгосын зах зээл дээрх Мэдээлэл технологийн төслүүдийг гүйцэтгэж дотоодын зах зээлээс хараат бус ажилладаг болно. Энэ чиглэлээр олон жил ажилласан туршлагатай хамт олон бүрдүүлэн үйл ажиллагаа явуулж байгаа бөгөөд Мэдээлэл технологийн салбарт хөл тавьж буй залуу эрин үеийг дэмжин ажиллахдаа таатай байна. Бидний эрхэм зорилго дэлхий ертөнц хурдтай өөрчлөгдөж, цахим хувьсгал өрнөж буй энэ эрин үед технологид суурилсан амжилтын гол чиглүүлэгч түнш нь байх үнэтэй хариуцлагатай үйлсэд бид бүхий л хүч чадлаа зориулан залуу эрин үеийг дэмжин ажиллах болно.'
  },
  weAreWanna: {
    KR: '우리는 개발자에게 무엇을 원하는가?',
    MN: 'Бид хөгжүүлэгчээс юу хүсдэг вэ?'
  },
  weAreWannaText: {
    KR: '지속적 노력과 배움의 의지',
    MN: 'Тууштай байдал, суралцах хүсэл эрмэлзэл.'
  },
  news: {
    KR: '알림 및 정보',
    MN: 'Мэдээ мэдээлэл'
  },
  talking: {
    KR: '면접',
    MN: 'Ярилцлага'
  },
  resumeTitle: {
    KR: '<strong>IT Wizard</strong> LLC의 공적 용도로 사용',
    MN: '<strong>IT Wizard</strong> ХХК-ний албан хэрэгцээнд зориулав.'
  },
  resumeReq1: {
    KR: '이력서를 정확하고, 약자 없이 작성하시오',
    MN: 'Анкетыг тодорхой, үг товчлохгүйгээр бичнэ үү.'
  },
  resumeReq2: {
    KR: '이력서를 보내기 전에 확인하십시오',
    MN: 'Анкетыг илгээхээс өмнө уншиж танилцана уу.'
  },
  resumeReq3: {
    KR: '몽골 크릴(Krill)어로 작성하십시오',
    MN: 'Крилл үсгээр бичнэ үү.'
  },
  resumeReq4: {
    KR: '( * )가 표시된 부분은 반드시 작성하십시오',
    MN: '( * ) агуулсан талбарыг заавал бөглөнө үү.'
  },
  myProfile: {
    KR: '마이 페이지',
    MN: 'Миний булан'
  },
  Logout: {
    KR: '로그아웃',
    MN: 'Гарах'
  },
  Login: {
    KR: '로그인',
    MN: 'Үргэлжлүүлэх'
  },
  waiting: {
    KR: '잠시 기다려주세요',
    MN: 'Түр хүлээнэ үү'
  },
  forgotPassword: {
    KR: '비밀번호 찾기',
    MN: 'Нууц үгээ мартсан?'
  },
  next: {
    KR: '다음',
    MN: 'Үргэлжлүүлэх'
  },
  backToLogin: {
    KR: '로그인 페이지로 돌아가기',
    MN: 'Нэвтрэх хэсэг рүү буцах'
  },
  username: {
    KR: '사용자 아이디',
    MN: 'Хэрэглэгчийн нэр'
  },
  password: {
    KR: '비밀번호',
    MN: 'Нууц үг'
  },
  mainInfo: {
    KR: '일반 정보',
    MN: 'Ерөнхий мэдээлэл'
  },
  lastname: {
    KR: '성',
    MN: 'Овог'
  },
  firstname: {
    KR: '성함',
    MN: 'Нэр'
  },
  birthdate: {
    KR: '생년월일',
    MN: 'Төрсөн огноо'
  },
  phoneNumber: {
    KR: '연락처',
    MN: 'Утасны дугаар'
  },
  registerNumber: {
    KR: '주밍등록번호',
    MN: 'Регистрийн дугаар'
  },
  emailAddress: {
    KR: '이멜일 주소',
    MN: 'Имэйл'
  },
  homeAddress:  {
    KR: '거주 주소',
    MN: 'Оршин сугаа хаяг'
  },
  FamiltyStatus: {
    KR: '가족 사항',
    MN: 'Гэр бүлийн байдал'
  },
  roleOfFamily: {
    KR: '관계',
    MN: 'Таны хэн болох'
  },
  professionName: {
    KR: '직업/ 직장',
    MN: 'Мэргэжил/ Ажлын байр'
  },
  EduStatus: {
    KR: '학력 정보',
    MN: 'Боловсролын талаархи мэдээлэл'
  },
  schoolName: {
    KR: '학교 명',
    MN: 'Сургуулийн нэр'
  },
  JobName: {
    KR: '전공',
    MN: 'Эзэмшсэн мэргэжил'
  },
  inYearSchool: {
    KR: '입학 연도 ',
    MN: 'Элссэн огноо'
  },
  outYearSchool: {
    KR: '졸업 연도',
    MN: 'Төгссөн огноо'
  },
  LanguateStatus: {
    KR: '외국어 능력 수준',
    MN: 'Гадаад хэлний мэдлэгийн түвшин'
  },
  otherLanguage: {
    KR: '외국어',
    MN: 'Гадаад хэл'
  },
  learnedYear: {
    KR: '경력',
    MN: 'Судалсан жил'
  },
  jobExperience: {
    KR: '근무 경력',
    MN: 'Ажлын туршлага'
  },
  compName: {
    KR: '회사 명',
    MN: 'Байгууллагын нэр'
  },
  jobPosition: {
    KR: '직위',
    MN: 'Албан тушаал'
  },
  inYear: {
    KR: '입사 날짜',
    MN: 'Орсон огноо'
  },
  outYear: {
    KR: '퇴사 날짜',
    MN: 'Гарсан огноо'
  },
  outReason: {
    KR: '퇴사 사유',
    MN: 'Гарсан шалтгаан'
  },
  advantage: {
    KR: '장점',
    MN: 'Давуу тал'
  },
  disAdvantage: {
    KR: '단점',
    MN: 'Сул тал'
  },
  advantageAndNo: {
    KR: '장점과 단점',
    MN: 'Давуу тал болон сул тал'
  },
  skill: {
    KR: '실력',
    MN: 'Ур чадвар'
  },
  programName: {
    KR: '띄어 쓰지 않음 (소문자, 대문자, 마침표를 사용하시오)',
    MN: 'Зай авахгүй (том, жижиг үсэг, цэг ашиглана уу)'
  },
  sendResume: {
    KR: '이력서 보내기',
    MN: 'Анкет илгээх'
  },
  pleaseChoose: {
    KR: '선택하십시오',
    MN: 'Сонгоно уу'
  },
  title: {
    KR: '제목',
    MN: 'Гарчиг'
  },
  phoneOrEmail: {
    KR: '연락처 혹은 이메일',
    MN: 'Утас эсвэл Имэйл'
  },
  description: {
    KR: '상세 내용',
    MN: 'Дэлгэрэнгүй'
  },
  sendToMessage: {
    KR: '메시지 보내기',
    MN: 'Мессеж илгээх'
  },
  list: {
    KR: '목록',
    MN: 'Жагсаалт'
  },
  personalInfo: {
    KR: '개인 정보',
    MN: 'Хувийн мэдээлэл'
  },
  feedback: {
    KR: '요청',
    MN: 'Санал хүсэлт'
  },
  planOfCompany: {
    KR: '회사 구조',
    MN: 'Байгууллагын бүтэц'
  },
  skillOfProgram: {
    KR: '프로그램 능력',
    MN: 'Программын ур чадвар'
  },
  feedbackSection: {
    KR: '요청 사항',
    MN: 'Санал хүсэлтийн булан'
  },
  type: {
    KR: '종류',
    MN: 'Төрөл'
  },
  sentDate: {
    KR: '보낸 날짜',
    MN: 'Илгээсэн огноо'
  },
  sendFeedback: {
    KR: '전송',
    MN: 'Хүсэлт илгээх'
  },
  changePassword: {
    KR: '비밀번호 변경',
    MN: 'Нууц үг солих'
  },
  update: {
    KR: '수정',
    MN: 'Шинэчлэх'
  },
  save: {
    KR: '저장',
    MN: 'Хадгалах'
  },
  cancel: {
    KR: '취소',
    MN: 'Болих'
  },
  Trainee: {
    KR: '실습생',
    MN: 'Trainee'
  },
  Junior: {
    KR: '초급',
    MN: 'Junior'
  },
  MidLevel: {
    KR: '중급',
    MN: 'Mid Level'
  },
  Senior: {
    KR: '고급',
    MN: 'Senior'
  },
  signin: {
    KR: '로그인',
    MN: 'Нэвтрэх'
  }
}


const textApi = (text) => {
  const lang = localStorage.getItem('lang');
  let language;
  if (!lang) {
    language = 'MN';
  } else {
    language = lang;
  }

  if (obj[text] && obj[text][language]) {
    return obj[text][language]
  }
  return '';
}

export default textApi;