const obj = {
  about: {
    KR: '회사소개',
    MN: 'Бидний тухай'
  },
  career: {
    KR: '인력',
    MN: 'Хүний нөөц'
  },
  team: {
    KR: '팀',
    MN: 'Хамт олон'
  },
  blog: {
    KR: '블로그',
    MN: 'Блог'
  },
  product: {
    KR: '포트폴리오',
    MN: 'Бүтээл'
  },
  address: {
    KR: '서울 금천구 가산디지털1로 5대륭테크노타운20차 402호',
    MN: 'Монгол улс, Улаанбаатар хот, Баянгол дүүрэг, 2-р хороо, 2-р хороолол, <br class="pcBreak">Сөүлийн гудамж, 47/1 байр'
  },
  phone: {
    KR: '+82 1644-5805',
    MN: '+976 7511-0023'
  },
  email: {
    KR: 'admin@tagoplus.co.kr',
    MN: 'admin@itwizard.mn'
  },
  history2018: {
    KR: 'OK토마토, 모렌소프트, 아이플랜비즈 등 다수업체 IT 아웃소싱 개발 용역 계약 체결',
    MN: 'OKtomato, morensoft, ilpanbiz etc... олон тооны компаниудтай хамтран IT outsourcing хийх гэрээ байгуулан амжилттай ажиллаж байна.'
  },
  history2019: {
    KR: 'IT 아웃소싱 분야 및 아웃소싱 SI',
    MN: 'IT outsourcing салбар болон outsourcing SI хөгжүүлэлт хийж хүрээгээ тэлсэн.'
  },
  history2020: {
    KR: '각종 솔루션 개발 및 유지보수 업무',
    MN: 'Төрөл бүрийн шийдэл боловсруулах, засвар үйлчилгээний ажиллууд хийгээд байна.'
  },
  history2021: {
    KR: '한국 IT Outsourcing 개발(60개 프로젝트) 수행',
    MN: 'Солонгос IT Outsourcing хөгжүүлэлт одоогоор (60 гаруй прожект дээр ажиллаад байна).'
  },
  ifYouWanna: {
    KR: '우리와 함께 일하고<br> 싶다면',
    MN: 'Хэрвээ бидэнтэй хамтарч<br>ажиллахыг хүсвэл.'
  },
  ifYouWannaQ: {
    KR: '개발자 여러분의 좋은 파트너이자<br>서포터가 되겠습니다',
    MN: 'Бид хөгжүүлэгч таны сайн хамтрагч,<br>дэмжигч байх болно.'
  },
  ourHistory: {
    KR: '우리의 히스토리',
    MN: 'Our history'
  },
  ifYouWannaSendCareer: {
    KR: '<span>이력서</span>보내기.<br><p style="opacity: 0;"></p>',
    MN: '<span>Хэрвээ анкет</span><br>илгээх бол.'
  },
  careerSteps: {
    KR: '선발 단계',
    MN: 'Сонгон шалгаруулах үе шат'
  },
  step1: {
    KR: '이력서 접수',
    MN: 'Анкет хүлээн<br>авах'
  },
  step2: {
    KR: '이력서 심사<br>및 선발',
    MN: 'Анкетын<br>шалгаруулалт'
  },
  step3: {
    KR: '면접',
    MN: 'Ярилцлага<br>уулзалт'
  },
  step4: {
    KR: '모집 제안',
    MN: 'Ажилд авах<br>санал'
  },
  checkBeforeSendCareer: {
    KR: '사유서 작성 전 확인',
    MN: 'Өргөдөл гаргахаасаа өмнө шалгах'
  },
  require1: {
    KR: '이력서 제출시 성명, 주소, 이메일, 근무 경력을 올비르게 작성하십시오',
    MN: 'Анкет илгээхдээ өөрийн нэр, холбоо барих хаяг, цахим шуудангийн хаяг, ажлын туршлагаа үнэн зөв бөглөнө үү.'
  },
  require2: {
    KR: '이력서에 작성한 정보, 근무 경력이 거짓인 경우 채용을 중단할 수 있다',
    MN: 'Анкет дээр бичсэн мэдээлэл, ажлын туршлага худал байвал элсэлтийг цуцалж болно.'
  },
  require3: {
    KR: '채용 과정에서 포지션에 따라 <b>추가 면접</b>, <b>추가 서류</b>, <b>실력 시험</b> 등이 추가될 수 있다',
    MN: 'Ажилд авах процесс дээр тухайн албан тушаалаас хамааран <strong>нэмэлт ярилцлага</strong>, <strong>лавлагаа</strong>,<br><strong>шалгалт</strong> гэх мэт зүйлс нэмэгдэж болно.'
  },
  require4: {
    KR: '지원 관련 문의는 <strong>admin@itwizard.mn</strong> 이메일을 보내주십시오.',
    MN: 'Дэмжлэгтэй холбоотой лавлагаа авахыг хүсвэл <strong>admin@itwizard.mn</strong> хаягаар имэйл илгээнэ үү.'
  },
  workplace: {
    KR: '오픈 인재채용',
    MN: 'Нээлттэй ажлын байр'
  },
  recommendedYou: {
    KR: '우리가 당신을 초대합니다',
    MN: 'Бид танд санал болгож<br>байна.'
  },
  recomm1: {
    KR: '편안한 작업 시설',
    MN: 'Тав тухтай ажиллах орчин'
  },
  recomm2: {
    KR: '활기차고 친절하며 재능있는 젊은 인재들',
    MN: 'Эрч хүчтэй, найрсаг, чадварлаг залуу хамт олон'
  },
  recomm3: {
    KR: '노동 시장의 경쟁력 있는 임금',
    MN: 'Хөдөлмөрийн зах зээлд өрсөлдөхүйц цалин'
  },
  recomm4: {
    KR: '분기별 상여금',
    MN: 'Улирал бүр бонус цалин'
  },
  recomm5: {
    KR: '교통비',
    MN: 'Унааны мөнгө'
  },
  recomm6: {
    KR: '지속적인 자기 개발 및 학습 기회 제공',
    MN: 'Тасралтгүй хөгжих, суралцах боломжийг олгоно'
  },
  aboutTitle: {
    KR: '정보기술 분야를 선도한다',
    MN: 'Мэдээлэл технологийн салбарыг тэргүүлнэ'
  },
  aboutText: {
    KR: '우리 기업은  2016년에 설립되어 대한민국 시장에서 IT 프로젝트를 아웃소싱하므로 국내 시장과 무관하게 독립적으로 운영되고 있습니다. 전문 분야의 우수 경험자들로 구성된 팀원과 함께 기술 산업에 첫 걸음을 내딛는 젊은 세대를 지원하게 되어 기쁩니다. 디지털 혁명화 및 급속도로 변화하는 이 시대에 기술 기반 성공의 핵심 파트너가 되는 책임 있는 일에 젊은 세대를 지원하고 성장시키는 데에 최선을 다하는 것이 우리의 비전입니다.',
    MN: 'Манай хамт олон нь 2016 оноос хойш үйл ажиллагаагаа явуулж байгаа бөгөөд бид Солонгосын зах зээл дээрх Мэдээлэл технологийн төслүүдийг гүйцэтгэж дотоодын зах зээлээс хараат бус ажилладаг болно. Энэ чиглэлээр олон жил ажилласан туршлагатай хамт олон бүрдүүлэн үйл ажиллагаа явуулж байгаа бөгөөд Мэдээлэл технологийн салбарт хөл тавьж буй залуу эрин үеийг дэмжин ажиллахдаа таатай байна. Бидний эрхэм зорилго дэлхий ертөнц хурдтай өөрчлөгдөж, цахим хувьсгал өрнөж буй энэ эрин үед технологид суурилсан амжилтын гол чиглүүлэгч түнш нь байх үнэтэй хариуцлагатай үйлсэд бид бүхий л хүч чадлаа зориулан залуу эрин үеийг дэмжин ажиллах болно.'
  },
  weAreWanna: {
    KR: '우리는 개발자에게 무엇을 원하는가?',
    MN: 'Бид хөгжүүлэгчээс юу хүсдэг вэ?'
  },
  weAreWannaText: {
    KR: '지속적 노력과 배움의 의지',
    MN: 'Тууштай байдал, суралцах хүсэл эрмэлзэл.'
  },
  news: {
    KR: '알림 및 정보',
    MN: 'Мэдээ мэдээлэл'
  },
  talking: {
    KR: '면접',
    MN: 'Ярилцлага'
  }
}


const textApi = (text) => {
  const lang = localStorage.getItem('lang');
  let language;
  if (!lang) {
    language = 'MN';
  } else {
    language = lang;
  }

  if (obj[text] && obj[text][language]) {
    return obj[text][language]
  }
  return '';
}

export default textApi;